/**********************************************************************************************/
/*  Title    : 사칙연산프로그램                                                               */
/*  Maker    : 20121105 고윤호                                                                */
/*  Date     : 2016-11-25                                                                     */
/*  Lst Modf : 2016-12-02
/*  Version  : 2.0                                                                            */
/*       2.0 : make header, add #if                                                           */
/*       1.0 : porototype                                                                     */
/*  Descript : v main(v)                                                                      */
/*                                                                                            */
/*                                                                                            */
/**********************************************************************************************/
/* < Comment list >                                                                           */
/* Cmt_1 : 디버그시 함수의 상태를 출력하는 함수 호출                                          */
/**********************************************************************************************/
#include "yhgo.h"                                    /* call : init(), menu(), print_func()   */

/* souce start : main    */
void main()
{
    /****************/
    /* 변수 선언    */
    /****************/
    int check;                                       /* 상태 확인                             */

    /****************/
    /* source       */
    /****************/
#if DBG_PRT
    print_func(__func__);                            /* Cmt_1                                 */
#endif
#if INIT_PRT
    init();                                          /* 처음 출력 메시지                      */
#endif
    do                                               /* dowhile_check : 연산 실행 반복        */
    {
        check = menu();                              /* 메뉴를 실행하고 상태 check에 저장     */
    } while(check);                                  /* dowhile_check End                     */
}/* main() End */
